#### Data frames
For Working with data frame, pandas is one of the best packages

In [7]:
import pandas as pd
import os
#os.getcwd()

In [8]:
data = pd.read_csv("C:\\Users\\sumad.singh\\Documents\\DS\\Python\\UDEMY_CODEACDMY\\mtcars.csv")
type(data)

pandas.core.frame.DataFrame

In [11]:
# Exploration of Data Set
# Getting to know basic information about the data set
#1. Dimensions of data set, len function give no. of rows
len(data)
#2. No. of columns. An object of type data frame carries functions with it, one being columns
len(data.columns)
#3. Getting the list of headers, notice the data type of what is returned is called index
print(data.columns)
type(data.columns)

Index(['Unnamed: 0', 'mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs',
       'am', 'gear', 'carb'],
      dtype='object')

In [12]:
# getting to see some rows of the data set
data.head()
data.tail(6)

,Unnamed: 0,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.7,0,1,5,2
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.9,1,1,5,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.5,0,1,5,4
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.5,0,1,5,6
30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.6,0,1,5,8
31,Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.6,1,1,4,2

Get to know information on column types, non-NULL records can be sone using info() function  
It gives you information on dimensions of dataset, class of dataset object, columnames, each column's data type. where  
float,integer are evident, column with string values is called object. info() is similar to str() in R

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 12 columns):
Unnamed: 0    32 non-null object
mpg           32 non-null float64
cyl           32 non-null int64
disp          32 non-null float64
hp            32 non-null int64
drat          32 non-null float64
wt            32 non-null float64
qsec          32 non-null float64
vs            32 non-null int64
am            32 non-null int64
gear          32 non-null int64
carb          32 non-null int64
dtypes: float64(5), int64(6), object(1)
memory usage: 3.1+ KB

In [18]:
# Similar but not same to summary() in R, you can get summary statistics of integer/float columns in pythong using describe()
summary = data.describe()
summary

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.0000
mean,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.848750,0.437500,0.406250,3.687500,2.8125
std,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.786943,0.504016,0.498991,0.737804,1.6152
min,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.892500,0.000000,0.000000,3.000000,2.0000
50%,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.710000,0.000000,0.000000,4.000000,2.0000
75%,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.900000,1.000000,1.000000,4.000000,4.0000
max,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000

In [15]:
type(data.describe())

pandas.core.frame.DataFrame

In [19]:
# data frame can be transposed using a pandas method
summary.transpose()

,count,mean,std,min,25%,50%,75%,max
mpg,32.0,20.090625,6.026948,10.400,15.42500,19.200,22.80,33.900
cyl,32.0,6.187500,1.785922,4.000,4.00000,6.000,8.00,8.000
disp,32.0,230.721875,123.938694,71.100,120.82500,196.300,326.00,472.000
hp,32.0,146.687500,68.562868,52.000,96.50000,123.000,180.00,335.000
drat,32.0,3.596563,0.534679,2.760,3.08000,3.695,3.92,4.930
wt,32.0,3.217250,0.978457,1.513,2.58125,3.325,3.61,5.424
qsec,32.0,17.848750,1.786943,14.500,16.89250,17.710,18.90,22.900
vs,32.0,0.437500,0.504016,0.000,0.00000,0.000,1.00,1.000
am,32.0,0.406250,0.498991,0.000,0.00000,0.000,1.00,1.000
gear,32.0,3.687500,0.737804,3.000,3.00000,4.000,4.00,5.000
carb,32.0,2.812500,1.615200,1.000,2.00000,2.000,4.00,8.000

In [20]:
# Changing column names of a data frame requires accessing colnames and passing a list of names, with inteneded changes
data.columns[[0,2,3]]

Index(['Unnamed: 0', 'cyl', 'disp'], dtype='object')

In [26]:
# By the method below, you cannot change one of the column names
#data.columns[0]='sn'

In [22]:
data.columns=['SN', 'mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs',
       'am', 'gear', 'carb']

In [24]:
data.columns

Index(['SN', 'mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am',
       'gear', 'carb'],
      dtype='object')

#### Accessing rows and columns of a data frame
1. Accessing rows  
Rows of a data frame can be accessed by using the splicing rules discussed in lists using [from:to:increment]  
NOTE: single brace with colon for columns as [,:] which used to  work for a matrix does not work for data frames

In [28]:
data[0:5]

,SN,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [29]:
# selecting rows from start till end by skipping one row
data[0::2]
# negative indexing will work as well
data[-1:-33:-1]
#the class that is returned is a data frame
type(data[-1:-33:-1])

pandas.core.frame.DataFrame

#### Accessing columns
Columns can be accessed by passing column names as a list of characters.
Use of column positions can be made by passing list of indicesm to 'iloc' method
Order of columns will be in the order the columns are referenced, in R it is partially similar as in you can pass a vector of   names or indices like data[,c(1,2,3)] or data[,c('disp,'mpg)]

In [49]:
data.iloc[:,[1,3]].head()
#data[['disp','mpg']].head()

    mpg   disp
0  21.0  160.0
1  21.0  160.0
2  22.8  108.0
3  21.4  258.0
4  18.7  360.0

In [52]:
# Quick access method using $ like access method as in R,eg: data $mpg
data.mpg.head()
# This required name to be one work i.e no spaces in between
# The other part is the data type returned by this method is pandas series
# type(data.mpg.head())

pandas.core.series.Series

#### Doing both, subsetting a data frame. 
These are two operations in sequence and hence the order does not matter, both yield same result

In [76]:
data[0:5][['mpg','cyl','disp']]
#data[['mpg','cyl','disp']][0:10]

    mpg  cyl   disp
0  21.0    6  160.0
1  21.0    6  160.0
2  22.8    4  108.0
3  21.4    6  258.0
4  18.7    8  360.0

In [79]:
# method iloc does not accept a sequence or names of columns. The below is not correct syntax wise, you can give 
#data.iloc[[0,1,10],['mpg','cyl','disp']]

# This works, use indices using iloc method, and supply lists for row and column indices
data.iloc[[0,2,1],[3,2,1]]

    disp  cyl   mpg
0  160.0    6  21.0
2  108.0    4  22.8
1  160.0    6  21.0

#### Adding, Dropping  columns

In [63]:
# Creating a new columns by just referencing it as if it exists, works like in R. Here quick access method won't work though
data['disp.per.cyl']=data['disp']/data['cyl']

In [81]:
# Dropping columns. Use built in method drop, and specify that a columns has to be dropped. 
#The method returns a new object
data.drop('disp.per.cyl',axis=1)
# Dropping more than one column required passing list of column names to be dropped, axis 
#argument conveys that columns need to be dropped
data.drop(['disp.per.cyl','carb'],axis=1).head()

                  SN   mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear
0          Mazda RX4  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4
1      Mazda RX4 Wag  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4
2         Datsun 710  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4
3     Hornet 4 Drive  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3
4  Hornet Sportabout  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3

#### Filtering data frames 
Python lets you work like R in comparing a list with a number, with every number compared against the number and a logical value is returned. Eg: data.gear<2 , returns a series object  
1. You can put logical conditions inside [], which return a boolean series. Joining of conditions can be done using  bitwise operators that operate on element by element basis  
2. The conditions need to be computed first and then a bitwise operation needs to be performed, we need to specify that by
 folding conditons in () and then apply a bit wise operation  
data[(data.gear>3) | (data.carb==4)]
** and , or are not bitwise operators in python

In [92]:
data[(data.gear>3) & (data.carb==4)]

,SN,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,disp.per.cyl
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4,26.666667
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4,26.666667
9,Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4,27.933333
10,Merc 280C,17.8,6,167.6,123,3.92,3.440,18.90,1,0,4,4,27.933333
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4,43.875000

#### Getting Unique values
To get unique values of a column a function unique() can be used with an object of type series , but not with data frames

In [93]:
data.carb.unique()
type(data.carb)

pandas.core.series.Series

In [96]:
# Will not work, because unique does not work on data frame objects, only sequences and series
#data[['carb','gear']].unique()

In [98]:
# Can use duplicated method to check if any row occurs more than once
data.duplicated()[1:5]

1    False
2    False
3    False
4    False
dtype: bool

#### filtering and column selection , accessing specific element of a data frame

In [95]:
data[data.gear>2][['cyl','disp']]

2    4
Name: cyl, dtype: int64

#### Ways to access specific elements
1. using indexing methods we have discussed, remember row indexing will need two inputs - from,to  
to carve out a single row 
2. The second approach is using pandas function .iat which lets you specify row 
and columns index or .at which lets you specify index and names, much like in R

In [102]:
data[2:4]['cyl']

2    4
3    6
Name: cyl, dtype: int64

In [106]:
data.iat[4,4]

175

In [108]:
data.at[3,'disp']

258.0